backend/tests/LoadTests/results/analytics-load-20260502-223532.txt

          /\      |ΓÇ╛ΓÇ╛| /ΓÇ╛ΓÇ╛/   /ΓÇ╛ΓÇ╛/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ΓÇ╛ΓÇ╛\  
   /          \   |  |\  \ |  (ΓÇ╛)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: .\analytics-advanced-load.js
        output: -

     scenarios: (100.00%) 3 scenarios, 6 max VUs, 27s max duration (incl. graceful stop):
              * smoke: 5 looping VUs for 20s (exec: smokeSuite)
              * baseline: Up to 1 looping VUs for 3s over 3 stages (gracefulRampDown: 0s, exec: baselineSuite, startTime: 12s)
              * stress: Up to 1 looping VUs for 3s over 3 stages (gracefulRampDown: 0s, exec: stressSuite, startTime: 24s)


running (01.0s), 5/6 VUs, 0 complete and 0 interrupted iterations
smoke      [   5% ] 5 VUs    01.0s/20s
baseline ΓÇó [   0% ] waiting  11.0s
stress   ΓÇó [   0% ] waiting  23.0s

running (02.0s), 5/6 VUs, 5 complete and 0 interrupted iterations
smoke      [  10% ] 5 VUs    02.0s/20s
baseline ΓÇó [   0% ] waiting  10.0s
stress   ΓÇó [   0% ] waiting  22.0s

running (03.0s), 5/6 VUs, 10 complete and 0 interrupted iterations
smoke      [  15% ] 5 VUs    03.0s/20s
baseline ΓÇó [   0% ] waiting  09.0s
stress   ΓÇó [   0% ] waiting  21.0s

running (04.0s), 5/6 VUs, 15 complete and 0 interrupted iterations
smoke      [  20% ] 5 VUs    04.0s/20s
baseline ΓÇó [   0% ] waiting  08.0s
stress   ΓÇó [   0% ] waiting  20.0s

running (05.0s), 5/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  25% ] 5 VUs    05.0s/20s
baseline ΓÇó [   0% ] waiting  07.0s
stress   ΓÇó [   0% ] waiting  19.0s

running (06.0s), 5/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  30% ] 5 VUs    06.0s/20s
baseline ΓÇó [   0% ] waiting  06.0s
stress   ΓÇó [   0% ] waiting  18.0s

running (07.0s), 5/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  35% ] 5 VUs    07.0s/20s
baseline ΓÇó [   0% ] waiting  05.0s
stress   ΓÇó [   0% ] waiting  17.0s

running (08.0s), 5/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  40% ] 5 VUs    08.0s/20s
baseline ΓÇó [   0% ] waiting  04.0s
stress   ΓÇó [   0% ] waiting  16.0s

running (09.0s), 5/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  45% ] 5 VUs    09.0s/20s
baseline ΓÇó [   0% ] waiting  03.0s
stress   ΓÇó [   0% ] waiting  15.0s

running (10.0s), 5/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  50% ] 5 VUs    10.0s/20s
baseline ΓÇó [   0% ] waiting  02.0s
stress   ΓÇó [   0% ] waiting  14.0s

running (11.0s), 5/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  55% ] 5 VUs    11.0s/20s
baseline ΓÇó [   0% ] waiting  01.0s
stress   ΓÇó [   0% ] waiting  13.0s

running (12.0s), 5/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  60% ] 5 VUs    12.0s/20s
baseline   [   0% ] started 
stress   ΓÇó [   0% ] waiting  12.0s

running (13.0s), 6/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  65% ] 5 VUs    13.0s/20s
baseline   [  33% ] 1/1 VUs  1.0s/3.0s
stress   ΓÇó [   0% ] waiting  11.0s

running (14.1s), 6/6 VUs, 20 complete and 0 interrupted iterations
smoke      [  70% ] 5 VUs    14.1s/20s
baseline   [  69% ] 1/1 VUs  2.1s/3.0s
stress   ΓÇó [   0% ] waiting  09.9s

running (15.0s), 5/6 VUs, 20 complete and 1 interrupted iterations
smoke      [  75% ] 5 VUs    15.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   ΓÇó [   0% ] waiting  09.0s

running (16.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke      [  80% ] 5 VUs    16.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   ΓÇó [   0% ] waiting  08.0s

running (17.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke      [  85% ] 5 VUs    17.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   ΓÇó [   0% ] waiting  07.0s

running (18.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke      [  90% ] 5 VUs    18.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   ΓÇó [   0% ] waiting  06.0s

running (19.0s), 5/6 VUs, 24 complete and 1 interrupted iterations
smoke      [  95% ] 5 VUs    19.0s/20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   ΓÇó [   0% ] waiting  05.0s

running (20.0s), 1/6 VUs, 24 complete and 5 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   ΓÇó [   0% ] waiting  04.0s

running (21.0s), 0/6 VUs, 24 complete and 6 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   ΓÇó [   0% ] waiting  03.0s

running (22.0s), 0/6 VUs, 24 complete and 6 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   ΓÇó [   0% ] waiting  02.0s

running (23.0s), 0/6 VUs, 24 complete and 6 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   ΓÇó [   0% ] waiting  01.0s

running (24.0s), 0/6 VUs, 24 complete and 6 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress     [   0% ] 1/1 VUs  0.0s/3.0s

running (25.0s), 1/6 VUs, 24 complete and 6 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress     [  33% ] 1/1 VUs  1.0s/3.0s

running (26.0s), 1/6 VUs, 24 complete and 6 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress     [  67% ] 1/1 VUs  2.0s/3.0s

running (27.0s), 1/6 VUs, 24 complete and 6 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress     [ 100% ] 1/1 VUs  3.0s/3.0s

     Γ£ô status is 200 (alert-events)
     Γ£ô status is 200 (heatmap)
     Γ£ô status is 200 (trends)
     Γ£ù status is 200 (tenant-summary)
      Γå│  96% ΓÇö Γ£ô 24 / Γ£ù 1
     Γ£ù status is 200 (slo-status)
      Γå│  83% ΓÇö Γ£ô 20 / Γ£ù 4

     checks.........................: 95.96% Γ£ô 119      Γ£ù 5  
     data_received..................: 51 kB  1.9 kB/s
     data_sent......................: 28 kB  1.0 kB/s
   Γ£ù failures.......................: 4.03%  Γ£ô 5        Γ£ù 119
     http_req_blocked...............: avg=1.02ms   min=0s    med=0s     max=25.75ms p(90)=0s      p(95)=0s      
     http_req_connecting............: avg=81.1┬╡s   min=0s    med=0s     max=2.61ms  p(90)=0s      p(95)=0s      
   Γ£ù http_req_duration..............: avg=412.92ms min=0s    med=3ms    max=10.01s  p(90)=29.04ms p(95)=55.13ms 
       { expected_response:true }...: avg=9.5ms    min=0s    med=2.99ms max=55.49ms p(90)=27.79ms p(95)=31.42ms 
   Γ£ù http_req_failed................: 4.03%  Γ£ô 5        Γ£ù 119
     http_req_receiving.............: avg=92.28┬╡s  min=0s    med=0s     max=3ms     p(90)=0s      p(95)=893.49┬╡s
     http_req_sending...............: avg=62.12┬╡s  min=0s    med=0s     max=2ms     p(90)=0s      p(95)=587.26┬╡s
     http_req_tls_handshaking.......: avg=0s       min=0s    med=0s     max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=412.77ms min=0s    med=3ms    max=10.01s  p(90)=27.79ms p(95)=55.13ms 
     http_reqs......................: 124    4.589376/s
     iteration_duration.............: avg=2.73s    min=1.01s med=1.05s  max=11.04s  p(90)=11.04s  p(95)=11.04s  
     iterations.....................: 24     0.888266/s
     vus............................: 1      min=0      max=6
     vus_max........................: 6      min=6      max=6


running (27.0s), 0/6 VUs, 24 complete and 7 interrupted iterations
smoke    Γ£ô [ 100% ] 5 VUs    20s
baseline Γ£ô [ 100% ] 1/1 VUs  3s
stress   Γ£ô [ 100% ] 1/1 VUs  3s